import type { ProjectCardType } from 'src/utils/types'

export const mockProjectCardsData: Array<ProjectCardType> = [
  {
    id: 1,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 2,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 3,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 4,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 5,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 6,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 7,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 8,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 9,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 10,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 11,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 12,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 14,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 16,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 1,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 1,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 17,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  },
  {
    id: 18,
    name: 'Газпром лавка',
    lead: {
      id: 1,
      name: 'Екатерина',
      lastname: 'Смирнова'
    },
    teams: [
      {
        id: 1,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 2,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
      {
        id: 3,
        name: 'Команда B2',
        departments: ['Аналитика', 'Разработка', 'Инфраструктура']
      },
    ]
  }
]
